{"en":{"title":"A Letter to My Teachers","publishDate":"2013/02/11","author":"Daniel Kao","description":"Dear Teachers, I’ve grown up with you, you have often the first person I see in the mornings, and on some days I’ve spent more time with you in your classrooms than with my family in my own home.","content":[{"type":"text","value":"Dear Teachers,"},{"type":"text","value":"I’ve grown up with you, you have often the first person I see in the mornings, and on some days I’ve spent more time with you in your classrooms than with my family in my own home. Thank you for the sacrifices you’ve made to teach me to the best of your ability. Each one of you has had an impact on the way that I see life, and contributed to the person I am today."},{"type":"text","value":"I thank you for being so consistent in the classroom, even on days when you weren’t in high spirits but still spent the effort and time to teach class. Thank you for taking the time to review our work, and for the times that you gave real and honest feedback to us."},{"type":"text","value":"I thank you for being so motivated, even when we have shown little or no interest in lectures by sleeping, texting, or talking, or even speaking slanderous words behind your back. It takes guts to do that, and I’m sure we don’t realize or acknowledge how much you have to sacrifice of yourself in order to teach us."},{"type":"text","value":"I appreciate you for all that you’ve sacrificed and who you are, and my interactions with you in the classroom have been the inspiration for my dream to come around and empower you to connect and teach your students on a whole new level. You’ve instilled in me a great value for education, and a real heart to believe in younger generations and inspire them to truly become themselves."},{"type":"text","value":"My dream is to bring a revolution to the way that you relate to and teach your students, not because I am angry or bitter, but because of a genuine desire to improve education to be more relevant to students, teachers, industries, and families. I dream of making your jobs even more fulfilling by building a system that encourages human connection and feedback, where trust becomes a path for you to have even greater impacts on the lives of your students."},{"type":"text","value":"My dream is to bring genuine trust and respect to parent-student-teacher relationships, so that teaching and tutoring fosters a human connection that extends deeper than simply the subject material. Because as I’ve realized in the last eighteen years, learning is just as much of an emotional process as a mental process if not more."},{"type":"text","value":"I know that it hurts you at times to give your students low grades because you believe in their potential to truly learn, but many times that has been lost in communication. I want to create a system where you are free to express that in order to inspire students, and make them look deeper than the letter grade on the surface."},{"type":"text","value":"But I can’t do this alone. I need your help. Just as I needed your help to understand academic concepts in your classes, I need your support at a time like this in order to bring a true revolution to the way schools are run."},{"type":"text","value":"This is dedicated to you."}],"slug":"a-letter-to-my-teachers","locale":"en"}}