{"en":{"title":"Thoughts on Journalistic Cartography","publishDate":"2023/01/11","author":"Daniel Kao","description":"News events of last year have resulted in a large variety of journalistic maps, which have become an indispensable part of reporting and helping readers understand the situation on the ground.","featureImage":"/images/2023/01/journalistic-cartography.jpg","content":[{"type":"text","value":"<p>One of the reasons I look forward to the end of the year is seeing all the year in reviews that different news organizations publish. Whether it be a collection of photos from the year, most popular articles, or the <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/interactive/2022/12/28/us/2022-year-in-graphics.html\">year in graphics</a>, these summaries provide a reminder of the news events and journalistic storytelling that were published, and the creative approaches that were built upon or invented in the past year.</p>\n"},{"type":"text","value":"<p>News events of last year have resulted in a large variety of journalistic maps, which have become an indispensable part of reporting and helping readers understand the situation on the ground. These maps have helped readers understand the <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/interactive/2022/world/europe/ukraine-maps.html\">war in Ukraine</a>, the <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://web.cw.com.tw/taiwan-strait-2021-en/index.html\">tensions in the Taiwan Strait</a>, the <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/interactive/2022/12/13/climate/climate-footprint-map-neighborhood.html\">effects of climate change</a>, the <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/interactive/2022/11/16/us/elections/republicans-house-congress.html\">political divides across the US</a>, and so much more.</p>\n"},{"type":"text","value":"<p>The tools for creating these maps and the conventions for creating interactive and understandable maps have also made huge strides in the past couple years, enabling graphics teams to publish quickly and consistently. For those who work on news graphics day to day, this is not new information for us, but rather advancements that we simply take for granted or even forget their significance once we adapt them into our workflows. But for those who are trying to better understand the technical implementations, whether you a student, editor, or other play another role, this post is a discussion about the current state of things, some suggestions, and the challenges ahead.</p>\n"},{"type":"text","value":"<p>Data and graphics journalism has, from its very inception, trodden the line between helping readers understand stories beyond what plain words can do without becoming too technical that only experts can understand. However, as trends change, what readers might understand or not understand changes, allowing for data and graphics teams to also push the envelope on what is a good, understandable piece of data or visual journalism.</p>\n"},{"type":"text","value":"<h2 id=\"the-evolution-of-journalistic-cartography\">The Evolution of Journalistic Cartography</h2>\n"},{"type":"text","value":"<p>Ten years ago, The New York Times published <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/projects/2012/snow-fall/index.html\">Snow Fall</a>, one of the earliest examples of visual storytelling on the web that would go on to <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/2022/12/23/insider/snow-fall-at-10-how-it-changed-journalism.html\">win a Pulitzer Prize</a> and be widely regarded as the piece that started it all. As a college freshman at the time, I missed the publication of the piece and the resulting discourse around the report at the time, but looking back now it’s clear how far projects have come.</p>\n"},{"type":"video","value":{"src":"/media/2023/01/snowfall.mp4","className":"full","autoplay":"true","muted":"true","loop":"true","playsinline":"true","preload":"metadata"}},{"type":"text","value":"<p>Looking back at Snow Fall now, it’s striking how much of the visual assets were simply embedded into autoplaying, looping, silent videos. Today, while video is still a common format to build visual journalism pieces off of, there has been a trend toward browser rendering or vector formats and animations for better clarity, performance, and interactivity. The 3D topographical model of the mountain as seen in Snow Fall was only possible through rendering a video back in 2012, but today it would be trivial to do something similar in mapboxgl.js for far better performance and resolution, such as <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/interactive/2022/10/04/climate/south-asia-monsoon-climate-change.html\">this piece on the Monsoons in South Asia</a>.</p>\n"},{"type":"text","value":"<p>Design-wise, we’ve also seen maps in news stories evolve to be clearer, better labeled to fit the stories, and colors and colors more carefully picked. Extraneous details are made grayscale or monochromatic, while critical pieces of information are given colors that are bright and clear. Animations and transitions are used sparingly but effectively to draw attention to important changes or layers of a story. Words are rendered by the browser whenever possible to make text accessible and clear. Legends are obvious and intuitive to help the reader understand any special lines or arrows on the map.</p>\n"},{"type":"image","value":{"src":"/images/2023/01/nytimes-ukraine-map.png","alt":"Ukraine Map by The New York Times","className":"full","crops":[{"image":"/images/2023/01/nytimes-ukraine-map.png","width":1280,"format":"png"},{"image":"/images/2023/01/nytimes-ukraine-map.png","width":768,"format":"png"},{"image":"/images/2023/01/nytimes-ukraine-map.png","width":640,"format":"png"}]}},{"type":"text","value":"<p>Maps have also adapted to social media platforms, being exported in small, bite-sized pieces that are published to Facebook, Twitter, Instagram, where there is even less room for superfluous information. It’s often difficult enough to make sure a map is legible on both desktop and mobile, let alone also optimized for each social media platform. This is where graphics teams have developed all sorts of internal tools to handle the rapid iteration of news graphics, especially when a story may need to be updated live and shared across social media.</p>\n"},{"type":"text","value":"<h2 id=\"svg-and-vectors\">SVG and Vectors</h2>\n"},{"type":"text","value":"<p>One of the most important tools for making dynamic, flexible graphics and maps is to keep things in a vector format as much as possible. Most of the time, this means using <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://developer.mozilla.org/en-US/docs/Web/SVG\">SVGs (scalable vector graphics)</a> to display on webpages and mobile applications. SVGs, when rendered through an application, allow for rapid edits and updates. <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://d3js.org/\">D3</a>, the most widely used tool for data graphics on the web, primarily works by manipulating SVG objects, including <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/d3/d3-geo\">powerful functions for handling projections and drawing geospatial data</a>.</p>\n"},{"type":"text","value":"<p>SVGs are attractive due to their platform-independent compatibility, such as being able to import an SVG map directly into print tools such as Adobe Illustrator, Indesign, etc. With computers and mobile devices getting more and more powerful, having maps rendered on the client is performant and has the sharpest visual appearance.</p>\n"},{"type":"text","value":"<p>However, the challenge for SVG maps on the web is that geospatial data is most transferred as <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://geojson.org/\">geojson</a> or <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/topojson/topojson\">topojson</a>, which is not a particularly space-efficient format. Generating and transferring geojson files to handle a dynamic, interactive map is expensive, often resulting in files that are hundreds of megabytes, which is unacceptable for users on mobile connections.</p>\n"},{"type":"text","value":"<p>One alternative to the geojson format that has gained popularity in recent years is <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://flatgeobuf.org/\">flatgeobuf</a>, a way to host a single file with complex geometries but have the client only download the geographic area it needs via http range requests, which can save a significant amount of bandwidth for large-scale interactive map experiences without the complexity of the other option: generating and hosting tiles, discussed below.</p>\n"},{"type":"text","value":"<h2 id=\"map-tiles\">Map Tiles</h2>\n"},{"type":"text","value":"<p>Map tiles work by splitting up the world into square tiles based on the zoom level and coordinates, so the client downloads and renders only the tiles it needs for the map view. If you’ve used online mapping tools such as google maps and have noticed that the map tends to load in squares, those are map tiles being rendered under the hood.</p>\n"},{"type":"image","value":{"src":"/media/2023/01/tiles.gif","alt":"Tiles","className":"full","disableSrcSet":"true","crops":[]}},{"type":"text","value":"<p>One of the early, popular libraries for implementing tiled maps is <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://leafletjs.com/\">leaflet</a>. Leaflet has a simple, well-documented, and extremely flexible set of tools for embedding a customizable, interactive map into a web page. Leaflet maps are still common today in many news projects. However, the go-to software stack for most web maps is <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.mapbox.com/\">Mapbox</a>. Mapbox allows users to host, customize, and share their own map tiles allowing so many newsrooms with fledgling graphics teams to get up and running quickly with powerful journalistic cartography.</p>\n"},{"type":"text","value":"<p>And just as Mapbox has enabled a whole slew of journalistic cartography, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://maplibre.org/projects/\">MapLibre</a> has been developing an open source version of MapboxGL as <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/mapbox/mapbox-gl-js/blob/main/CHANGELOG.md#200\">MapboxGL version 2 has transitioned to a not quite open source model</a>. The potential for new open source tools to even further transform the way that news organizations create maps is exciting. Tiling tools such as <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://github.com/mapbox/tippecanoe\">Tippecanoe</a>, <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://protomaps.com/docs/pmtiles/\">PMTiles</a>, and others will continue to evolve and become part of our cartography toolkits.</p>\n"},{"type":"text","value":"<h2 id=\"webgl\">WebGL</h2>\n"},{"type":"text","value":"<p>Under the hood of <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://docs.mapbox.com/mapbox-gl-js/guides/\">mapboxgl.js</a> is <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://developer.mozilla.org/en-US/docs/Web/API/WebGL_API\">webGL</a>, a browser API that gives access to shaders that are run directly on the GPU for maximum performance in rendering to web browsers. WebGL has been used for games on the web, complex 3D modeling, and more recently cartography applications. While having all of this power to utilize the GPU allows for so much more dynamic and powerful graphics, shader code is written in a completely different paradigm than something like Javascript or Python, making it often difficult to create graphics in WebGL.</p>\n"},{"type":"video","value":{"src":"/media/2023/01/webgl.mov","className":"full","autoplay":"true","muted":"true","loop":"true","playsinline":"true","preload":"metadata"}},{"type":"text","value":"<p>So far, the most common implementation of WebGL has been these kinds of <a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.nytimes.com/interactive/2022/10/04/climate/south-asia-monsoon-climate-change.html\">wind or weather flows</a>. But as graphics and journalistic cartography becomes an even more integral part of the newsroom workflow, I expect to see more graphics using WebGL, utilizing movement and animations for even more map detail in all sorts of areas.</p>\n"},{"type":"text","value":"<h2 id=\"looking-to-2023\">Looking to 2023</h2>\n"},{"type":"text","value":"<p>As we start a new year, I’m excited to see the kinds of projects and digital cartography techniques that are published in this coming year, especially as humanity encounters climate, political, social, economic, and cultural challenges. I’m excited to continue building visualizations to accompany news stories, whether it be cartographic or otherwise.</p>\n"},{"type":"text","value":"<p><em>Shameless plug: I am open to freelance or contract roles for this year, so if you’d like to work with me on a project, don’t hesitate to reach out!</em></p>\n"}],"featureImageCrops":[{"image":"/images/2023/01/journalistic-cartography.jpg","width":1920,"format":"jpg"},{"image":"/images/2023/01/journalistic-cartography.jpg","width":1280,"format":"jpg"},{"image":"/images/2023/01/journalistic-cartography.jpg","width":768,"format":"jpg"},{"image":"/images/2023/01/journalistic-cartography.jpg","width":640,"format":"jpg"}],"slug":"journalistic-cartography","locale":"en"}}