{"en":{"title":"On Ambiverts: Why Distinguishing Between Extroverts and Introverts is Inadequate","publishDate":"2013/06/08","author":"Daniel Kao","description":"I’ve always hated the distinction between introverts and extroverts because I never could identify with either side.","featureImage":"/images/2020/10/origin_4724793799.jpg","content":[{"type":"text","value":"I’ve always hated the distinction between introverts and extroverts because I never could identify with either side. The accepted school of thought is that a person is either one or the other, without any middle ground."},{"type":"text","value":"According to <a href=\"https://en.wikipedia.org/wiki/Myers-Briggs_Type_Indicator\" target=\"_blank\" rel=\"noopener noreferrer\">Myers Briggs</a>, perhaps the most widely popular and accepted personality test, extroverts are action oriented, seek breadth of knowledge and influence, prefer frequent interaction, and get energy from spending time with people while introverts are thought oriented, seek depth of knowledge and influence, prefer more substantial interaction, and get their energy from spending time alone."},{"type":"text","value":"> However, contrary to the binary choices provided by Myers Briggs, I’ve realized that extroversion/introversion is a spectrum, like a person’s height."},{"type":"text","value":"All of my life, I’ve had people (family, close friends, teachers, counselors) tell me different things. Some would say I was an introvert, and others would say that I was an extrovert. To different people I seemed to be different things."},{"type":"text","value":"After browsing the web and looking at a few more resources and doing some reflection, I came across a term called the ambivert, and finally felt understood by a personality test. I am very much an ambivert. There seems to be very little written about ambiverts, (Evernote isn’t even recognizing it as a word) so here are my thoughts."},{"type":"text","value":"Ambiverts sit on the spectrum of social interaction right in between the introverts and extroverts. Ambiverts love spending time with people, but get tired after spending too much time around people. Ambiverts are also very capable of doing things alone, but spending an entire day alone can suck them into a depressed, unproductive mood."},{"type":"text","value":"Ambiverts love interacting with people, but in a very purposeful way. Ambiverts can have extremely animated and interactive conversations, or mellow and meditative ones. Ambiverts will defend both their personal time as well as their social time."},{"type":"text","value":"Ambiverts process information best when they process internally and externally. Ambiverts need time and space to process things on their own, but they also need people who they can trust to process things with externally. In order for ambiverts to fully process information, they usually need both."},{"type":"text","value":"Ambiverts seek breadth of knowledge and influence, but dive deep when they are truly passionate. Ambiverts can be thought or action oriented, depending on the situation, but they are also oftentimes both."},{"type":"text","value":"The challenge for ambiverts is finding one thing to stick with. Because ambiverts do well socially and individually, it’s easy for an ambivert to become the jack of all trades, having knowledge in many different areas but not necessarily an expert an any of them."},{"type":"text","value":"Ambiverts tend to do well adapting to any situation that they are placed in, whether it be a loud social scene or a secluded environment."},{"type":"text","value":"However, no matter if you identify as an extrovert, introvert, or ambivert, don’t let a personality test define how you think about yourself. Figuring out how you work best for yourself is much more helpful than any test."},{"type":"text","value":"What do you think? Where would you put yourself on the spectrum?"}],"slug":"on-ambiverts-why-distinguishing-between-extroverts-and-introverts-is-inadequate","locale":"en"}}