{"en":{"title":"Why You Shouldn't Become a College Dropout","publishDate":"2016/08/30","author":"Daniel Kao","description":"In college, I frequently thought about dropping out of school to pursue startup ambitions, but in retrospect, getting my degree was the better choice.","content":[{"type":"text","value":"In college, I frequently thought about dropping out of school to pursue startup ambitions, but in retrospect, getting my degree was the better choice."},{"type":"text","value":"Four years ago, I sat down with my parents and handed them a proposal for taking a gap year. I spent weeks excruciating over this letter, finally articulating all of my thoughts into words:"},{"type":"text","value":"> “…Many of my peers attend and eagerly await nothing but the end. Learning becomes a burden and a chore, and done solely for the sake of obtaining a diploma. I want to be able to clearly see the difference between learning for the sake of actually knowing vs learning for the sake of finishing school. Seeing a world outside of what I currently know and am used to will give me a perspective / reality check whenever I feel unmotivated to learn…”"},{"type":"text","value":"Long story short, I didn’t know what I wanted to do with my life, and wanted time before college to figure that out."},{"type":"text","value":"At least that’s what I told my parents. My real struggle wasn’t entirely about figuring out what I wanted to do with my life, but also about figuring out why higher education would be valuable to me. At the time, I saw college as an expensive waste of time filled with empty promises of material success that I would leave me unfulfilled."},{"type":"text","value":"All my high school friends seemed to be talking about the schools they wanted to attend while I spent my days considering why college would be valuable for me. I heard many reasons over and over for the next few months, but none of them satisfied me. I was dissatisfied with the system, jaded by all the contrived homework questions and classes."},{"type":"text","value":"I couldn’t see how doing homework and taking tests would help me in the real world of business and engineering. I couldn’t see how going through a four year program would be more time and cost effective in learning the skills I needed in my career."},{"type":"text","value":"When I consulted with my parents and other mentor figures in my life at the time, I felt like I was speaking on a different wavelength. It seemed that I was being carried by a stream of blind faith that “engineering was the only way to make a living” and that I had to go to college to get into those jobs. But as I boiled down their points into things that I could consider, I heard a few very common reasons that I should get a college degree."},{"type":"text","value":"### “You need a college engineering degree to get a job.”"},{"type":"text","value":"As kindergarteners, our teachers welcomed us to class by asking us what we wanted to be when we grew up, encouraging us to follow our aspirations of becoming firefighters, authors, teachers, etc. But the older we got, the responses to these “childish” ambitions turned into not-so-subtle demands to take advanced math classes in order to pursue more lucrative professions."},{"type":"text","value":"We were inundated with talk from parents and peers about the schools and jobs that “people they know” got in a seemingly endless comparison of one’s worth to their education and career pedigrees. And yet, despite all the talk about getting in to good schools, the emphasis seemed to be placed on one of three fields: engineering, medicine, or law."},{"type":"text","value":"Dissatisfied with those arguments, I found myself inspired by stories of people who went against conventional wisdom to make significant contributions in their fields without having a college degree: Steve Jobs, Bill Gates, Mark Zuckerberg, etc. I spent sleepless nights listening to speeches, reading books, and watching documentaries about these larger-than-life figures, hoping to extract the things that made them great and apply them to my life."},{"type":"text","value":"With so many examples of successful people who had dropped out of college as well as college graduates that struggled to secure employment, I concluded that the prerequisites for success surely must be independent from whether someone actually followed through with college or not. If education was nothing more than a series of hoops that people had to jump through to obtain a piece of paper, there had to be more effective ways of building up credibility in a field. I could probably teach myself practical aspects of computer science instead of getting stuck in the theory taught by academia."},{"type":"text","value":"### “College is a place to meet people and build a network.”"},{"type":"text","value":"One of the most common things that people would tell me was about the people they had the opportunity to meet in college, forming the strongest groups of friends that they still interact with in their adult lives. They argued that the college years was the best time to make friends, build a professional network, and date."},{"type":"text","value":"This point made little sense to me, as college life was as appealing as getting tangled into a web horrible frat parties, boring lecture halls, and awful dorm experiences while paying obscene amounts to do so. How was I going to find a network among other students? I wanted to meet and learn from top figures in industry, not students that would ask to copy my homework."},{"type":"text","value":"I couldn’t see how attending college would help me build a network of connections that would help me start my career, because everyone that I wanted to network with weren’t anywhere close to academia. I looked up to programs like the Thiel Fellowship and Uncollege because they gave their fellows access to networks of entrepreneurs in Silicon Valley."},{"type":"text","value":"### “College gives you time to experiment before being in the real world.”"},{"type":"text","value":"To many, college is also the time for people to try things and learn from mistakes. If the goal is to move fast and break things, I was told that college would be a place where I could make mistakes in a safer sandbox."},{"type":"text","value":"But if college is supposed to be a sandbox for me to learn and experiment before going out into the world, why is it structured as a series of classes and lectures? To me, things like grades, curves, and application processes made college feel more like a competition rather than the experimental laboratory that people were telling me it would be. Additionally, it seemed more appealing to experiment outside of the walls of academia, where the money that would be going toward tuition would go much further than what I might get out of academia."},{"type":"text","value":"I felt that a self-education system based on traveling, reading, and one-on-one meetings would be much more personalized and impactful personally. I could read books on my own, meet with experts, and travel for less than the cost of a year’s worth of tuition. And with so much content available online, I could access any information whenever I wanted to."},{"type":"text","value":"## So What is College For?"},{"type":"text","value":"But despite all these reservations about the value of higher education, I went."},{"type":"text","value":"One night toward the beginning of my freshman year, I was sitting on the Warren lawn talking to a few new friends I had just made. I had been hesitant to share my reservations about higher education with anyone up to that point, but that night I made my thoughts known."},{"type":"text","value":"“I don’t know if I’ll stay in college. I mean, I don’t see the point.”"},{"type":"text","value":"In retrospect, telling people that you might leave college is not the best way to make friends as a freshman, but somehow these people stuck with me and became my best college friends. As college life quickly enveloped every aspect life, I struggled with an inner voice doubting if I was doing the right thing with my life."},{"type":"text","value":"I went through most of my first year trying to figure out how to make the most of my college education, given the fact that I didn’t feel like my education had a purpose. I attended events whenever I could, always looking for an excuse to spend time away from my campus. I didn’t really care about my grades, and slipped into academic probation toward the middle of my sophomore year."},{"type":"text","value":"I remember opening that email and seeing a hideous 1.866 GPA. At that moment, I was met with a real decision: Either I would put more effort into my academics or I would leave entirely and work full-time on my self-education that I had been doing concurrently with college."},{"type":"text","value":"Then, a few weeks later, I found myself on a trip to Silicon Valley with <a href=\"https://www.brighteyes-students.org/\" target=\"_blank\" rel=\"noopener noreferrer\">BrightEyes</a>, a program designed to give UCSD students a tour of startups and venture capital in Silicon Valley. I was talking to <a href=\"https://tiffanydstone.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Tiffany</a>, the director of the BrightEyes program, asking for advice on how I should reconcile my startup ambitions with my education."},{"type":"text","value":"“You need to finish school.” She told me."},{"type":"text","value":"Coming back after BrightEyes, I reluctantly decided I would invest more into my academics. I pulled myself out of academic probation, but the question remained: what is the point of college?"},{"type":"text","value":"At some point in my junior year, I came across an <a href=\"https://harpers.org/archive/2015/09/the-neoliberal-arts/\" target=\"_blank\" rel=\"noopener noreferrer\">article by William Deresiewicz</a> that challenged my fundamental assumptions about college."},{"type":"text","value":"> “This is education in the age of neoliberalism. Call it Reaganism or Thatcherism, economism or market fundamentalism, neoliberalism is an ideology that reduces all values to money values. The worth of a thing is the price of the thing. The worth of a person is the wealth of the person. Neoliberalism tells you that you are valuable exclusively in terms of your activity in the marketplace — in Wordsworth’s phrase, your getting and spending."},{"type":"text","value":"> …"},{"type":"text","value":"> It is not the humanities per se that are under attack. It is learning: learning for its own sake, curiosity for its own sake, ideas for their own sake. It is the liberal arts, but understood in their true meaning, as all of those fields in which knowledge is pursued as an end in itself, the sciences and social sciences included. History, sociology, and political-science majors endure the same kind of ritual hazing (“Oh, so you decided to go for the big bucks”) as do people who major in French or philosophy. Governor Rick Scott of Florida has singled out anthropology majors as something that his state does not need more of. Everybody talks about the STEM fields — science, technology, engineering, and math — but no one’s really interested in science, and no one’s really interested in math: interested in funding them, interested in having their kids or their constituents pursue careers in them. That leaves technology and engineering, which means (since the second is a subset of the first) it leaves technology.”"},{"type":"text","value":"Little did I know, but this one essay would lead me to realize that the purpose of a university education is so much greater than the career that would be enabled as a result. Yes, college degrees often serve as a funnel into specific careers, but seeing college as merely a means to a job is selling it short of what it really is."},{"type":"text","value":"Learning for the sake of applying it to a career to make money is hollow at best. Learning is so much more than that; it’s about exploring the creative aspects of humanity, thinking deeply about existence, relationships, and phenomena in our universe. It’s about learning for learning’s sake, allowing curiosity to lead you where money won’t, and becoming a more informed citizen."},{"type":"text","value":"At a certain level, universities represent the best of this curiosity. Whether it be forays into areas of arts, humanities, and literature or scientific endeavors to sequence the human genome, curiosity enables universities to create the world of tomorrow. Universities are home to some of the most groundbreaking and innovative research that currently exists. The fundamental incentives and structure of university research leads to technology breakthroughs that would not be discovered in industry. Just consider physics research as CERN, Oceanography research at UCSD, etc."},{"type":"text","value":"The value of a college degree isn’t about the student experience, future careers, or social circles. College is valuable for the exploration and discovery of yourself, the world, and how the two interact. It’s about being alongside faculty and professors that are pioneers in their respective fields, whether it be biological research, quantum physics, or another field."},{"type":"text","value":"The fact that public universities are exempt from the pressures to build and sell products in the same way that corporations are allows public universities to approach subjects from a different angle, giving students and faculty the freedom to explore natural phenomenon, history, etc without worrying about finding profitable applications for their research."},{"type":"text","value":"This allows academia to explore things at a much deeper, more holistic level, often allowing them to do research that is far ahead of industry, and working out the fundamental theory of why things work. There’s a general trend of people criticizing universities for being too theoretical and not adequately preparing students for the real world, but the truth is that we need universities to continue focusing on theory. Specifics become obsolete much faster than theory does."},{"type":"text","value":"As a society ingrained in the profit motive, it’s no surprise that colleges market themselves as a place for students to learn how to be successful in industry. But as I had to figure out on my own, that’s not the point of an education. We need to start having real expectations of what college is and what it isn’t. College isn’t optimized for being successful in the workplace, it’s optimized for creating an environment that lets people explore deeply on the issues we face today."},{"type":"text","value":"College isn’t for everyone, especially given the calculus of going to college for an economic incentive. But regardless, college is an opportunity that everyone should have, regardless of race, class, status, or gender. And for those interested in jumping straight into a career, we should be giving apprenticeship and bootcamp programs much more consideration in the talent pipeline."},{"type":"text","value":"Once I decided that my college education wasn’t about establishing a future career for myself, it freed me to dive deeper into the things I wanted to learn just for the sake of learning. I found myself enjoying classes and assignments for this first time, appreciative of being able to learn from and talk to the faculty that was teaching me."},{"type":"text","value":"So to everyone who helped me through my college years, I have two things to say. First, sorry if I was difficult through the years in my frustrations. And second, thank you for your support, I would not be where I am today if I hadn’t gone through college."}],"slug":"why-you-shouldnt-become-a-college-dropout","locale":"en"}}